#Задача 28: Напишите рекурсивную функцию sum(a, b),
#возвращающую сумму двух целых неотрицательных чисел. Из
#всех арифметических операций допускаются только +1 и -1.
#Также нельзя использовать циклы.
a = int(input('Введите неотрицательное число A: '))
b = int(input('Введите неотрицательное число B: '))
def sum(a, b):
    a -= 1
    b += 1
    if a > 0:
        return sum(a, b)
    else:
        return b    
print(f'Сумма двух неотрицательных чисел равна: {sum(a, b)}')