#Задача 32: Определить индексы элементов массива (списка),
#значения которых принадлежат заданному диапазону (т.е. не
#меньше заданного минимума и не больше заданного
#максимума)
from random import randint
n = int(input('Введите количество элементов массива: '))
arr = []
for i in range(n):
    arr.append(randint(0, 100))
print(f' Наш массив: {arr}')
minn = int(input('Введите минимум диапозона значений элементов: '))
maxx = int(input('Введите максимум диапозона значений элементов: '))
new = []
for i in range(n):
    if (arr[i] >= minn) and (arr[i] <= maxx):
        new.append(i)
print(f' Вот индексы элементов нашего массива, принадлежащих к диапазону: {new}')