#Задача 30: Заполните массив элементами арифметической
#прогрессии. Её первый элемент, разность и количество
#элементов нужно ввести с клавиатуры. Формула для
#получения n-го члена прогрессии: 
#an = a1 + (n-1) * d.
#Каждое число вводится с новой строки.

first = int(input('Введите первый элемент прогрессии: '))
d = int(input('Введите разность чисел в прогрессии: '))
n = int(input('Введите количество элементов прогрессии: '))
a = [0]
a[0] = first
for i in range(1,n):
    a.append(first + (d*(i)))
print(f'Вот наша арифметическая прогрессия: {a}')