# Найдите сумму цифр трехзначного числа. 
a = input('Введите трехзначное число: ')
summ = int(a[0]) + int(a[1]) + int(a[2])
print(f'Сумма цифр трехзначного числа равняется: {summ}')