#Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
#круглой грядке, причем кусты высажены только по окружности. Таким образом, у
#каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
#Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
#выросло различное число ягод – на i-ом кусте выросло ai
#ягод.
#В этом фермерском хозяйстве внедрена система автоматического сбора черники.
#Эта система состоит из управляющего модуля и нескольких собирающих модулей.
#Собирающий модуль за один заход, находясь непосредственно перед некоторым
#кустом, собирает ягоды с этого куста и с двух соседних с ним.
#Напишите программу для нахождения максимального числа ягод, которое может
#собрать за один заход собирающий модуль, находясь перед некоторым кустом
#заданной во входном файле грядки.

n = int(input('Введите количество кустов черники на грядке: '))
row = []
for i in range(n):
    row.append(i+1)
print(row)
sum = row[0]+row[1]+row[2]
for i in range(n-3):
    sum2 = row[i+1]+row[i+2]+row[i+3]
    if sum2 >= sum: sum = sum2
print(f'Вот максимальное число чгод, которое можно собрать за один заход: {sum}')