# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх
#решкой, а некоторые – гербом. Определите минимальное число
#монеток, которые нужно перевернуть, чтобы все монетки были
#повернуты вверх одной и той же стороной. Выведите минимальное
#количество монет, которые нужно перевернуть.

from random import randint
n = int(input('Введите количество монеток на столе: '))
listcoin = []
for i in range(n):
    listcoin.append(randint(0, 1))
print(f' Вот монеты, за 1 принимаем "орел", за 0 - "решку": {listcoin}')
sum0 = int(0)
sum1 = int(0)
for i in range(n):
    if listcoin[i] == 1:
        sum1+=1
    else:
        sum0+=1
if sum0 > sum1:
    print(f'Нужно перевернуть {sum1} монеток, чтобы все были решкой вверх(минимальное количество действий)')
else:
    print(f'Нужно перевернуть {sum0} монеток, чтобы все были орлом вверх(минимальное количество действий)')