#Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
#они сделали S журавликов. Сколько журавликов сделал каждый
#ребенок, если известно, что Петя и Сережа сделали одинаковое
#количество журавликов, а Катя сделала в два раза больше журавликов,
#чем Петя и Сережа вместе?

S = input('Введите количество сделанных детьми журавликов: ')
SerPet = int(S) / 6
SerPet = int(SerPet)
Katya = SerPet * 4
print(f'Петя сделал {SerPet}, Катя сделала {Katya}, а Сережа - {SerPet} журавликов')