#Задача 8: Требуется определить, можно ли от шоколадки размером n
#× m долек отломить k долек, если разрешается сделать один разлом по
#прямой между дольками (то есть разломить шоколадку на два
#прямоугольника).

n = int(input('Введите ширину шоколадки в дольках: '))
m = int(input('Введите длину шоколадки в дольках: '))
k = int(input('Введите количество долек, которое хотите отломить за один разлом: '))
slices = n * m
if k == 1 and n != 1 and m != 1:
    print('NO')
elif slices % k == n or slices % k == m or slices % k == 0:
    print('Yes')
else:
    print('NO')